Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90-S1/svd/PIC32CZ8110CA90208S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>TIMERS</name>
         <description>Timer Module</description>
         <groupName>TIMERS</groupName>
         <prependToName>TIMERS_</prependToName>
         <baseAddress>0x52001800</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x28</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>RST</name>
               <description>Reset</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>STOP</name>
               <description>Stop</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>INTEN</name>
               <description>Interrupt Enable</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>INTDIS</name>
               <description>Interrupt Disable</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>STAT</name>
               <description>Status</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CNT0</name>
               <description>Counter 0</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>MATCH0</name>
               <description>Match 0</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>CNT1</name>
               <description>Counter 1</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>MATCH1</name>
               <description>Match 1</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>WDT</name>
         <description>Watchdog Timer Module</description>
         <groupName>WDT</groupName>
         <prependToName>WDT_</prependToName>
         <baseAddress>0x52000C00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>WDCOUNT</name>
               <description>Count</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>WDRELOAD</name>
               <description>Reload</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>WDKICK</name>
               <description>Kick</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <access>write-only</access>
            </register>
            <register>
               <name>WDCONTROL</name>
               <description>Control</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WDRSTEN</name>
                     <description>WDRSTEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WDSTATUS</name>
               <description>Status</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
            <register>
               <name>WDSTOP</name>
               <description>Stop</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
            </register>
         </registers>
      </peripheral>
   </peripherals>
</device>
